title: Suspicious scheduled task creation
status: experimental
description: Detects the creation of scheduled tasks to run anomalous programs
references:
    - https://labs.f-secure.com/publications/ti-report-lazarus-group-cryptocurrency-vertical
    - https://labs.f-secure.com/blog/catching-lazarus-threat-intelligence-to-real-detection-logic-part-two
author: F-Secure Countercept
date: 2020/09/25
level: high

logsource:
    category: process_creation
    product: windows

detection:
    selection1:
        Image: '*\schtasks.exe'
    selection2:
        CommandLine|contains:
            - 'reg add'
            - 'reg.exe add'
    selection3:
        CommandLine|re: '\s*(-|/)e(n(c(o(d(e(d(c(o(m(m(a(n(d)?)?)?)?)?)?)?)?)?)?)?)?)?\s'
    selection4:
        CommandLine|re: '\s*(-|/)ec\s'
    selection5:
        CommandLine|re: 's*(-|/)encodeda\s'
    selection6:
        CommandLine|re: '\s*(-|/)encodedarguments\s'

    condition: selection1 and (selection2 or selection3 or selection4 or selection5 or selection6)

falsepositives:
    - Unlikely
