title: Powershell with IP arguments
status: experimental
description: Detects Powershell execution with arguments containing external IP addresses
references:
    - https://labs.f-secure.com/publications/ti-report-lazarus-group-cryptocurrency-vertical 
    - https://labs.f-secure.com/blog/catching-lazarus-threat-intelligence-to-real-detection-logic
author: F-Secure Countercept
date: 2020/09/25
level: low

logsource:
    category: process_creation
    product: windows

detection:
    selection1:
        Image|contains: '*\powershell.exe'
        CommandLine|re: '.*(([0-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5])\.){3}([0-9]|[1-9][0-9]|1[0-9][0-9]|2[0-4][0-9]|25[0-5]).*'
    selection2:
        CommandLine|re: '.*((127\..+)|(10\..+)|(172\.1[6-9]\..+)|(172\.2[0-9]\..+)|(172\.3[0-1]\..+)|(192\.168\..+)|(169\.254\..+)).*'
    condition: selection1 and not selection2

falsepositives:
    - Administrative scripts
