title: Clearing/exporting windows security event logs
status: experimental
description: Detects the use of wevtutil to clear or export Windows Security logs
references:
    - https://labs.f-secure.com/publications/ti-report-lazarus-group-cryptocurrency-vertical 
    - https://labs.f-secure.com/blog/catching-lazarus-threat-intelligence-to-real-detection-logic-part-two
author: F-Secure Countercept
date: 2020/09/25
level: medium

logsource:
    category: process_creation
    product: windows

detection:
    selection1:
        Image: '*\wevtutil.exe'
        CommandLine|contains: 
            - 'epl Security'
            - 'export-log Security'
            - 'cl Security'
            - 'clear-log Security'
    selection2:
        ParentImage: '*\MsSense.exe'
    condition: selection1 and not selection2

falsepositives:
    - Administrative activity, significantly less false positives for clearing logs (cl)
