title: Word document launching explorer
status: experimental
description: Detects explorer being launched by Microsoft Word document
references:
    - https://labs.f-secure.com/publications/ti-report-lazarus-group-cryptocurrency-vertical
    - https://labs.f-secure.com/blog/catching-lazarus-threat-intelligence-to-real-detection-logic
author: F-Secure Countercept 
date: 2020/09/25
level: medium

logsource:
    category: process_creation
    product: windows

detection:
    selection:
        ParentImage: '*\winword.exe'
        Image: '*\explorer.exe'
    condition: selection

falsepositives:
    - Activity from legitimate macro-enabled Word documents, varies across estates

